app/views/items/show.html.erb


<% @item.item_photos.each do |p|%>
---
SELECT "item_photos".* FROM "item_photos" WHERE "item_photos"."item_id" = ?  [["item_id", 2]]