app/controllers/item_photos_controller.rb

 def destroy
   @item_photo = ItemPhoto.find(params[:id])
   item = @item_photo.item
   @item_photo.destroy
---
SELECT  "item_photos".* FROM "item_photos" WHERE "item_photos"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "item_photos" WHERE "item_photos"."id" = ?  [["id", 9]]