app/controllers/items_controller.rb

INSERT INTO "items" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "item01"], ["created_at", "2018-06-11 06:32:35.588167"], ["updated_at", "2018-06-11 06:32:35.588167"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save