app/controllers/love_days_controller.rb

INSERT INTO "love_days" ("startday", "endday", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["startday", "2018-01-10 07:49:00"], ["endday", "2018-06-10 07:49:00"], ["created_at", "2018-06-10 07:58:44.927791"], ["updated_at", "2018-06-10 07:58:44.927791"]]
---
  def create
    @love_day = LoveDay.new(love_day_params)

    if @love_day.save

SELECT  "love_days".* FROM "love_days" WHERE "love_days"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @love_day = LoveDay.find(params[:id])