app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    image = params[:image]
    if @product.save
---
INSERT INTO "products" ("name", "image", "price", "quantity", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 99.0], ["updated_at", "2018-06-10 07:30:01.359248"], ["id", 1]]