app/controllers/users_controller.rb

  def create
    @user = User.new(friend_params)

    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2018-06-11 03:59:49.880342"], ["updated_at", "2018-06-11 03:59:49.880342"]]

def destroy_avatar
  @user = User.find(params[:id])
  @user.avatar = nil
  @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", nil], ["avatar_content_type", nil], ["avatar_file_size", nil], ["avatar_updated_at", nil], ["updated_at", "2018-06-11 03:15:44.118442"], ["id", 1]]